Catalogs/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМСПриУстановке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьРеализацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСрокНахожденияНаСкладе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСМС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМСПоШаблону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВозвратТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВозвратДенег</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВСтатусе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьСхемуРезервирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРезервирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыРезервирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачуНаОтветственного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьВнПеремещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаВнПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗадачуСрокХранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСрокХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаГруппеПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьМаркетПлэйс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрыватьРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТелеграм</Name>
					<Comment>Уведомление уходит в тот же момент, когда создаётся задача просрочки статуса.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмЧат</Name>
					<Comment>Кому слать уведомление о просрочке этого статуса. Один или несколько chat_id через запятую - уйдёт каждому. Заполнено - шлём (галка "Отправлять в Telegram" при этом не обязательна); пусто и галка стоит - берём чат от статуса, где он заполнен. chat_id узнаётся один раз: получатель нажимает Start у бота, затем chat_id виден в журнале регистрации, событие "Телеграм.Чаты".</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмЧатСмены</Name>
					<Comment>Второй сценарий: написать менеджеру СРАЗУ, как заказ перешёл в этот статус (реквизит "Телеграм: чаты" - про просрочку, то есть "висит дольше нормы"). Один или несколько chat_id через запятую, пусто - при смене не пишем. Отправка идёт не из транзакции записи заказа, а через очередь ТелеграмОчередь, которую разбирает регламент ТелеграмОбмен.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредыдущиеСтатусыУсловиеОтправкиСМС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатусЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыЗаказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СтатусыЗаказов/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
// Карточка статуса заказа - управляемая форма элемента справочника СтатусыЗаказов.
//
// Перенесена с обычной формы (Forms/ФормаЭлемента, Form.bin) один в один по логике,
// изменилась только раскладка: правила разложены по страницам Основное / Документы /
// СМС / Телеграм / Задачи. Обычная форма из конфигурации не удалена - чтобы вернуться,
// достаточно переключить DefaultObjectForm в Catalogs/СтатусыЗаказов.xml обратно.
//
// Исполнитель задачи по просрочке статуса задаётся одним из трёх взаимно исключающих
// способов: конкретный пользователь (Пользователь1), группа пользователей
// (ЗадачаГруппеПользователей) или ответственный за заказ
// (ФормироватьЗадачуНаОтветственного). Читает их БИАС.ПроверкаЗадачь именно в этом
// порядке, поэтому заполненный вариант блокирует остальные - иначе два заполненных
// поля означали бы, что второе молча не работает.
//
// После записи исполнитель переставляется у уже созданных незакрытых задач
// (ПереназначитьЗадачиПросрочки): без этого смена ответственного в карточке статуса
// не доходила бы до задач, которые уже висят на прежнем человеке.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИсполнительПросрочкиПриОткрытии = ИсполнительПросрочки(Объект);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ИсполнительПросрочкиПриОткрытии = ИсполнительПросрочки(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьЭлементы();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ПереназначитьЗадачиПросрочки(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСМСПоШаблонуПриИзменении(Элемент)

	НастроитьЭлементы();

КонецПроцедуры

// Один способ выдачи задачи по просрочке исключает два других: заполнили поле -
// остальные очищаются и становятся недоступными.
//
&НаКлиенте
Процедура ИсполнительПросрочкиПриИзменении(Элемент)

	ПустойПользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");

	Если ЗначениеЗаполнено(Объект.Пользователь1) Тогда

		Объект.ЗадачаГруппеПользователей         = ПустойПользователь;
		Объект.ФормироватьЗадачуНаОтветственного = Ложь;

	ИначеЕсли ЗначениеЗаполнено(Объект.ЗадачаГруппеПользователей) Тогда

		Объект.Пользователь1                     = ПустойПользователь;
		Объект.ФормироватьЗадачуНаОтветственного = Ложь;

	ИначеЕсли Объект.ФормироватьЗадачуНаОтветственного Тогда

		Объект.Пользователь1             = ПустойПользователь;
		Объект.ЗадачаГруппеПользователей = ПустойПользователь;

	КонецЕсли;

	НастроитьЭлементы();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНовыеЧаты(Команда)

	Сообщить(НовыеЧатыБота());

КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭлементы()

	Элементы.ШаблонСМС.Видимость = Объект.ОтправлятьСМСПоШаблону;

	Элементы.Пользователь1.Доступность =
		(Не ЗначениеЗаполнено(Объект.ЗадачаГруппеПользователей) И Не Объект.ФормироватьЗадачуНаОтветственного);

	Элементы.ЗадачаГруппеПользователей.Доступность =
		(Не ЗначениеЗаполнено(Объект.Пользователь1) И Не Объект.ФормироватьЗадачуНаОтветственного);

	Элементы.ФормироватьЗадачуНаОтветственного.Доступность =
		(Не ЗначениеЗаполнено(Объект.Пользователь1) И Не ЗначениеЗаполнено(Объект.ЗадачаГруппеПользователей));

КонецПроцедуры

// Кому уходит задача по просрочке статуса. Порядок проверок - как в БИАС.ПроверкаЗадачь.
//
// Параметры:
//  Статус - СправочникОбъект.СтатусыЗаказов - карточка статуса.
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи, Строка, Неопределено - пользователь или группа,
//  "НаОтветственного" для ответственного за заказ, Неопределено - задачу не выдаём.
//
&НаСервере
Функция ИсполнительПросрочки(Знач Статус)

	Если ЗначениеЗаполнено(Статус.Пользователь1) Тогда

		Возврат Статус.Пользователь1;

	ИначеЕсли ЗначениеЗаполнено(Статус.ЗадачаГруппеПользователей) Тогда

		Возврат Статус.ЗадачаГруппеПользователей;

	ИначеЕсли Статус.ФормироватьЗадачуНаОтветственного Тогда

		Возврат "НаОтветственного";

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Переставить исполнителя у незакрытых задач по просрочке этого статуса.
// "НаОтветственного" разворачивается в ответственного самого заказа, поэтому
// сравнивать приходится уже развёрнутые значения - иначе задача переписывалась бы
// каждый раз при записи карточки.
//
&НаСервере
Процедура ПереназначитьЗадачиПросрочки(ТекущийОбъект)

	Исполнитель = ИсполнительПросрочки(ТекущийОбъект);

	Если Не ЗначениеЗаполнено(Исполнитель)
		Или Исполнитель = ИсполнительПросрочкиПриОткрытии Тогда

		ИсполнительПросрочкиПриОткрытии = Исполнитель;
		Возврат;

	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст =

		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачиПользователя.Ссылка КАК Ссылка,
		|	ЗадачиПользователя.Объект.Ответственный КАК Ответственный
		|ИЗ
		|	Задача.ЗадачиПользователя КАК ЗадачиПользователя
		|ГДЕ
		|	НЕ ЗадачиПользователя.Выполнена
		|	И ЗадачиПользователя.ИдентификаторСобытия = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", "ПросрочкаСтатуса_" + ТекущийОбъект.Код);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		ИсполнительДо = ИсполнительПросрочкиПриОткрытии;

		Если ИсполнительПросрочкиПриОткрытии = "НаОтветственного" Тогда

			ИсполнительДо = Выборка.Ответственный;

		КонецЕсли;

		ИсполнительПосле = Исполнитель;

		Если Исполнитель = "НаОтветственного" Тогда

			ИсполнительПосле = Выборка.Ответственный;

		КонецЕсли;

		Если ИсполнительПосле = ИсполнительДо Тогда

			Продолжить;

		КонецЕсли;

		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();

		ЗадачаОбъект.Исполнитель = ИсполнительПосле;

		ЗадачаОбъект.Записать();

	КонецЦикла;

	ИсполнительПросрочкиПриОткрытии = Исполнитель;

КонецПроцедуры

// Чаты, которые уже написали боту: их ID и вставляются в поля выше.
//
&НаСервереБезКонтекста
Функция НовыеЧатыБота()

	Возврат ТелеграмБот.ПоказатьНовыеЧаты();

КонецФункции
